Revit 2027 API
IFCExtrusionCreationData Constructor
 The default constructor.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCExtrusionCreationData()
Public Sub New
public:
IFCExtrusionCreationData()
new : unit -> IFCExtrusionCreationData
Remarks
 All input data will be considered uninitialized.
See Also
Reference
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace